---
kind: type
id: T:Autodesk.Revit.UI.ExternalApplicationArrayIterator
source: html/ef67cb34-f1ac-5dd5-6b6f-169334b7512e.htm
---
# Autodesk.Revit.UI.ExternalApplicationArrayIterator

An iterator to an array of IExternalApplication objects..

## Syntax (C#)
```csharp
public abstract class ExternalApplicationArrayIterator : APIObject,
	IEnumerator
```